Repository: seanpm2001/mt-training-data
Catalog: ppl/ppl_pontoon.tmx
Source language: en_us
Languages: ppl

source: Data aggregators, or data brokers, collect information from public records and buy it from other companies. They compile this data to sell it to companies for marketing purposes. Victims of these breaches are less likely to experience financial fraud, but hackers could use this data to impersonate or profile them.
ppl: Ne tasentalilis ipal datoj, u tanamakani ipal datoj, kipena ne iinformación tukniwan, kiana wan kikuilia ujuksé compañíaj. Kisentepewat ini datoj pal kinamaka ujuksé compañiaj pal kichiwat marketing. Ne kiejekuat ini kaltapanalis anka te weli kichtekiliat pero ne pijpirataj welit kikwit ini dajdatoj pal tashijshikuat u pal kichiwat se perfil inpal.

source: Data breaches are on the rise. If your personal info appears in a new data breach, { -product-name } sends you an alert — so you can take action and protect your accounts.
ppl: Ne taichtekilis ipal mudatoj panu ukseujseujti an. Asu mudatoj nesi tik seuk taichtekilis, { -product-name } metznawatis — pal tesu tikejkawa panu uksenpa wan tiktajpia mucuejcuentaj ukyek.

source: Do I need to do anything if a breach happened years ago or this is an old account?
ppl: Ninemi pal nikchiwa taya asu panuk se taichtekilis ashan miak shiwit wan asu ini ishtapual te yankwik?

source: Download { -brand-name }
ppl: Shiktemulti { -brand-name }

source: Due to the sensitive nature of this breach, emails involved are not publicly discoverable. You’re receiving this alert because you’re the verified owner of this email address.
ppl: Ipanpa nejmach ini taichtekilis, ne titanamat te weli mutemua. Tikselia ini tanawatilis ika taja ne itekuyu ini titantukayit.

source: Email Address:
ppl: Titantukayit:

source: Email address being monitored
ppl: Ne idijdirección mucorreoj mupepeta nemi

source: Email Addresses
ppl: Dijdirección correoj

source: Email me if one of my email addresses below appears in a data breach.
ppl: Shinechtuktili asu se ipal nudirección ipal correoj muajsi tik ne kaltapanalis ipal datoj.

source: Email Sent!
ppl: Ne amatitanti mutitanijtuk!

source: Email Verification Required
ppl: Muneki mupepeta mucorreoj

source: Enroll multiple emails in breach monitoring
ppl: Shikachitili miak correoj kan mupepetat ne kajkaltapanalis

source: Enter Email Address
ppl: Shikalakti ne Amatitantukayit

source: Error
ppl: Tatakul

source: Error connecting to { -brand-HIBP }.
ppl: Te welik musalua itech { -brand-HIBP }.

source: Even for old accounts, it’s important to update your password.
ppl: Nusan iwan se muishmachiu palikman, nemi pal tikyankwilia muichtakatajkwilul.

source: Filter by Category:
ppl: Shikektali ken Tasheshelul

source: Find Out
ppl: Shikmajmati

source: Find out if your data was exposed in this breach.
ppl: Shikmati asu mudajdatoj muneshtijket keman mukaltapanket.

source: Find out if you’ve been part of a data breach
ppl: Shikita asu mudatoj kichtektiwit ichtaka.

source: Find out if you’ve been part of a data breach with { -product-name }. Sign up for alerts about future breaches and get tips to keep your accounts safe.
ppl: Shikita asu ajaka kichtek ichtaka mudatoj iwan { -product-name }. Shikchiwa se cuentaj pal timetznawatisket wan timetzmachtisket ken tiktajpia mucuentaj.

source: Find out what hackers already know about you. Learn how to stay a step ahead of them.
ppl: Shikajsi ne tay ne hacker kimatiaya mupanpa. Shimumachti ken tiweli titayakana ka inhishpan.

source: Find out what you need to do to keep your data safe from cyber criminals.
ppl: Shimumachti tay muneki pal tiktajpia mutamatil wan hackers te kichtekit ichtaka.

source: Firefox Account
ppl: Cuentaj ipal Firefox

source: Frequently asked questions
ppl: Tay Senpa Tajtanit

source: Frequently Asked Questions
ppl: Ne tay miak kitajtanit

source: Get a dashboard view
ppl: Shikilwiti ne itachialis ne tamatil

source: Get help creating better passwords and keeping them safe.
ppl: Shiktajtani ma metzpalewi tikchiwa ukchupi yek taketzalis ichtaka wan tiktajpia

source: Get help remembering all your passwords and keeping them safe.
ppl: Ma metzpalewi tikelnamiki muchi mutajtaketzalis ichtaka wan ma kitajpia.

source: Get notifications in your browser
ppl: Shikpia tanawatilis tik mutajtachialis

source: Get ongoing alerts with a { -brand-fxa }.
ppl: Shikpia tanawatilis iwan { -brand-fxa }.

source: Get ongoing breach monitoring for multiple email addresses.
ppl: Shikpepeta mukaltapanalis tik miak dijdirección correoj.

source: Hackers may try to use that same password and your email to get in to other accounts. Create a different and unique password for every account, especially for your bank account, email, and other websites where you save personal information.
ppl: Ne hackers anka kikalaktisket ne sesan taketzalis ichtaka wan kikwisket mucorreoj pal kalakit tik ujukse cuentaj. Shikchiwa se taketzalis ichtaka te kenha wan ma te keman mukwijtuk ipal sejse cuentaj, wan ipal ne icuentaj mutuminkal, correoj, wan ujukse iswat ka matapan kan tiktajpia ne muinformación.

source: Have an account?
ppl: Tikpia se ishtapual?

source: Have your online accounts been exposed in a data breach?
ppl: Tichikuyulua ajaka kichtek ush kineki kikwi ne mukwejkwentaj online?

source: Here’s what’s changed since you signed up for { -product-name }, the service that monitors known data breaches for your personal info. We’re linking it to Firefox accounts.
ppl: Ini tay mupatak kwak tipan tiktalij mutukay tik { -product-name } , ne tayekultilis ne kishkupawia tamatil taichtekilis kan nemi mutamatilsyu. Tiknepanuat iwan ne Firefox ishtapal.

source: Here’s your summary of past data breaches
ppl: Nikan nemi mutapualis ipal tamatilichtekilis

source: Home
ppl: Nuchan

source: How does { -product-name } treat sensitive sites?
ppl: Tay { -product-name } kichiwa iwan ne sijsitioj ichtaka?

source: How do I know this is a legitimate email from { -product-name }?
ppl: Ken nikmati asu ini se correoj tejkia ipal { -product-name }?

source: However, it did appear in { $breachCount } other breaches.
ppl: Melka, yaja neski tik { $breachCount } seuk mukaltapanalis.

source: However, it did appear in { $breachCount } other known breaches.
ppl: Melka yaja kia nesik tik { $breachCount } sejseuk mukaltapanalis matituk

source: How { -product-name } works
ppl: Ken { -product-name } tekiti

source: How to create strong passwords
ppl: Ken tikchiwa taketzalis ichtaka tajpaltik

source: How to unsubscribe from { -product-name } alerts
ppl: Ken nikishtia nutukay tik ne tanawatilis { -product-name }

source: I don’t recognize one of these companies or websites. Why am I in this breach?
ppl: Te nikishmati ini tekipan u tzawalamat. Taika ninemi tik ini taichtekilis?

source: I don’t recognize this company or website. Why am I in this breach?
ppl: Naja te nikishmati ini compañiaj u sitioj Matapan. Taika ninemi tik ini kaltapanalis?

source: If you can’t log in, contact the website to ask how to update it. See an account you don’t recognize? Your data could have been sold or redistributed. This could also be an account you forgot you created or a company that changed names.
ppl: Asu te tiweli tikalaki tik mucuentaj, shiknawati ne iswat ka matapan ma metzilwi ken tikyankwilia. Tikita se cuentaj tesu tikmati? Mudajdatoj anka munamaskiat u mumajmakatuk ka senkak. Yajini anka nusan se cuentaj tiklelnamikik tikchiwki u anka se compañíaj kipatak ne tujtukay.

source: If your information surfaces in a new data breach, we’ll send you an alert.
ppl: Asu muinformación nesi tik se kaltapanalis yankwik, tiu-timetztitaniliat se tanawatilis.

source: If you use { -brand-name }, you’ll receive a notification if you visit a site that’s been breached. Find out right away if you were part of that breach and what you can do about it.
ppl: Asu tikwi { -brand-name }, tiu-tikpia se tanawatilis asu tipashalua tik se sitioj kikaltapanket. Shikmati nemanha asu kikaltapan muinformación wan tay tiweli tikchiwa ipanpa.

source: I just found out I’m in a data breach. What do I do next?
ppl: San nikmatki ka ninemi tik se tamatil taichtekilis. Tay nikchiwa?

source: Invalid Email
ppl: Te Yek Amatitanti

source: Invalid session
ppl: Ne sesión tesu yek

source: It can sometimes take months or years for credentials exposed in a data breach to appear on the dark web. Breaches get added to our database as soon as they have been discovered and verified.
ppl: Weli ishtuna sejsé metzti u shiwit achtu ma ne crejcredencial mukishtijtuk tik ne kaltapanialis ipal datoj nesikan tik ne Matapan kunyua. Musentaliat ne kaltapanalis tik tubasej ipal datoj kan muajsitiwit wan mupepettiwit.

source: It’s easy to find birthdays, addresses, and family member names online. Keep these words out of your passwords.
ppl: Te uij muajsit ne tunal tinesik, mudirección, wan ne intujtukay muikniwan tik ne matapan. Maka shiktali ini tajtaketzalis tik ne taketzalis ichtaka.

source: Keep getting email alerts
ppl: Shiktukti senpa ne amatukayit tanawatilis

source: Known data breaches have exposed your info
ppl: Yajyankwik mukaltapanalis matituk kineshtijtuk muinformación

source: LATEST BREACH ADDED
ppl: Yankwik taichtekilis ipal mudatoj tikachilijtuk

source: Learn more.
ppl: Shimumachtiuk!

source: Learn more about { $fxmLink }
ppl: Shimumachti ipanpa { $fxmLink }

source: Legal
ppl: Tajtuli

source: Made by { -brand-Mozilla }
ppl: Ne kichiwtuk { -brand-Mozilla }

source: Make the new password different and unique
ppl: Shikchiwa ne yankwik taketzalis ichtaka tekenha wan isel

source: Manage { -brand-fxa }
ppl: Shiktuktia { -brand-fxa }

source: Manage Email Addresses
ppl: Shiktajpia ne dijdirección ipal correoj

source: Menu
ppl: Tapejpenalamat

source: Monitor several emails
ppl: Shikpepeta miak correoj

source: More about this breach
ppl: Shikmati ukchupi keman taichtekikket mudatoj

source: Most breaches only expose emails and passwords, but some do include sensitive financial information. If your bank account or credit card numbers were exposed, alert your bank to possible fraud. Monitor statements for charges you don’t recognize.
ppl: Achka muchi ne taichtekilis ipal datoj kiwawana ne itukay mucorreoj wan taketzalis-ichtaka, man sejse kia kanat weyuk datoj ipal mutumin.

source: Most people have about 100 online accounts. Have any of yours been exposed in a data breach? Find out.
ppl: Achka muchi kipia 100 cuentaj salujtuk. Have any of yours been exposed in a data breach? Find out.

source: Must be a valid email
ppl: Muneki se yek amatitanti.

source: Must be a valid email.
ppl: Muneki se yek amatitanti.

source: No other breaches found from a basic search.
ppl: Te muajsik seuk mukaltapanalis tik ini talul tatemulis.

source: On { $breachDate }, { $breachTitle } was breached. Once the breach was discovered and verified, it was added to our database on { $addedDate }.
ppl: Ne { $breachDate }, mukaltapanket tik { $breachTitle }. Kan muajsik wan muyekitak ne mukaltapanalis, yaja mutalij tik ne basej dajdatoj tik { $addedDate }.

source: Open { -brand-fxa } navigation
ppl: Shiktapu ne pashalualis { -brand-fxa }

source: Other Monitored Emails
ppl: Seuk correoj mupepettuk

source: Overview
ppl: Ken nesi muchi

source: Page not found.
ppl: Iswat te muajsik.

source: Password managers like 1Password, LastPass, Dashlane, and Bitwarden store your passwords and fill them in to websites for you. They’ll even help you make strong passwords.
ppl: Tajpianimet ipal taketzalis ichtaka ken 1Password, LastPass, Dashlane, wan Bitwarden kiana mutajtaketzalis ichtaka wan kiishtukilia mumaku. Yejemet yawit kichiwat tajtaketzalis ichtaka chupiuk tajpaltik.

source: Password managers like 1Password, LastPass, Dashlane, and Bitwarden store your passwords securely and fill them into websites for you. Use a password manager on your phone and computer so you don’t have to remember them all.
ppl: Ne tajpianimet ipal taktezalis ichtaka ken 1Password, LastPass, Dashlane, wan Bitwarden kianat wan kitajpia mutaketzalis ichtaka wan kishtukat tik ne iswat ka matapan. Shikwi se tajpiani ipal taketzalis ichtaka wan shiktali tik mutanutzalis wan tepustapuani pal tesu nemi pal tikelnamiki muchi yejemet.

source: Passwords exposed across all breaches
ppl: Ne ijichtaka taketzalis muneshtijket tik muchi ne mukaltapanalis

source: Preferences
ppl: Tay nikneki

source: { -product-name } found no known breaches
ppl: { -product-name } te kiajsik se taichtekilis

source: { -product-name } found your email in a new data breach
ppl: { -product-name } kiajsik mucorreoj tik se kaltapanalis yankwik dajdatoj

source: { -product-name } found your info in these breaches
ppl: { -product-name } kiajsik mutamatilis tik se taichtekilis

source: { -product-name } only reveals accounts associated with these types of breaches after an email address has been verified. This means you’re the only person who can see if your information was in this breach (unless someone else has access to your email account).
ppl: { -product-name } semaya kineshtia ne cuejcuentaj senhijilpituk iwan ini tipoj ipal kaltapanalis keman se dirección pal correoj mupepettuka. Kineki ina ka maya taja tiweli tikita asu kikaltapanket muinformación (a menos que uksé weli kalaki tik mucuentaj ipal correoj).

source: { -product-name } Report
ppl: { -product-name } Shikteilwi

source: { -product-name } : Scan Results
ppl: { -product-name } : Shikchiwa escanear ne tay kiski

source: { -product-name } : Unsubscribe
ppl: { -product-name } : Shikishti mutukay

source: { -product-name } warns if your online accounts were involved in a data breach. Find out if you’ve been in a data breach, get alerts about new breaches, and take steps to protect your online accounts. { -product-name } is provided by { -brand-Mozilla }.
ppl: { -product-name } tanawatia asu mucuejcuentaj tik ne matapan nemiket tik se kaltapanalis. Shikmati asu tinemik tik se kaltapanalis, shikita ne tanawatalis ipanpa yajyankwik kaltapanalis, wan shikpalewi mucuejcuentaj tik ne matapan. { -brand-Mozilla } metzmaka { -product-name }

source: { -product-name } warns you about data breaches involving your personal info. So far, no breaches were found. We’ll send you an alert if your email address appears in a new breach.
ppl: { -product-name } metznawatia ipanpa se tamatil taichtekilis ne nemi itech mutamatilisyu. Ijkiashan, te kanaj se taichtekilis. Tiu-timetznawatiat asu mutitantukay nesi tik se yankwik taichtekilis.

source: { -product-name } warns you about data breaches involving your personal info. We just received details about another company’s data breach.
ppl: { -product-name } metznawatia ipanpa se tamatil taichtekilis ne nemi itech mutamatilisyu. San tikselijket tamatilis ipanpa se taichtekilis tik seuk tekipan.

source: { -product-name } warns you about data breaches involving your personal info. You’re also signed up to receive alerts if your email address appears in a new breach.
ppl: { -product-name } metznawatia ipanpa se tamatil taichtekilis ne nemi itech mutamatilisyu. Nusan tiktalijtuk mutukay pal tikselia tanawatilis asu mutitantukay nesi tik se yankwik taichtekilis.

source: { -product-name } warns you if your email address has been exposed in an online data breach. See if your information has been exposed, learn how to better protect your online accounts, and get alerted if your email address appears in a new breach.
ppl: { -product-name } metznawatia asu mudirección ipal correoj mutapujtuk tik se kaltapanalis ipal datoj tik ne matapan. Shikita asu muinformación mutapujtuk, shikmati ken tiweli tikpalewia ukchupi yek mucuejcuentaj tik ne matapan, wan shikwi tanawatilis asu mudirección ipal correoj nesi tik uksé yankwik kaltapanalis.

source: Protect your online privacy
ppl: Shikpalewi ne tay mupal ichtaka.

source: Read More Security Tips
ppl: Shiamatachiayuk ipanpa ne tanajnawatil.

source: Remove { -product-name }
ppl: Shikishti { -product-name }

source: Report Date:
ppl: Itunal ne Tenewalis:

source: Resend verification email
ppl: Shiktitani uksenpa ne correoj kan mupepettuk.

source: Results for: { $userEmail }
ppl: Walkisalis ipal: { $userEmail }

source: Search all your email addresses for breaches and get alerts about new threats.
ppl: Shiktemu itzalan muchi ne itujtukay correoj asu kaltapanket tik yejemet wan ma metznawatikan keman metzmajmawat uksenpa.

source: Search Breaches
ppl: Shiktemu mukaltapanalis

source: Searches temporarily suspended
ppl: Ne kanaj tatemulis an

source: Search for your email address in public data breaches going back to 2007.
ppl: Shiktemu mudirección correoj tik ne kaltapanalis pal datoj ipal tukniwan hasta 2007.

source: Search for your email address in public data breaches going back to 2007. This basic search will surface most data breaches, but not ones that contain sensitive personal information.
ppl: Shiktemu ne mutitantukay tik ne tamatilichtekilis ne pejket tik 2007. Ini tatemulis yu-kineshtia kachka muchi ne tamatilichtekilis, pero tesu yu-kineshtia ichtaka tamatilis mupanpa.

source: Search Your Email
ppl: Shiktemu Muamatitantukay

source: Security Tips
ppl: Tanajnawatil pal tiktajpia mudatoj

source: Security tips to protect your accounts
ppl: Tanawatilis ipal tapalewilis pal tikmanawi mucuejcuentaj

source: Security tips to protect yourself from hackers
ppl: Tanawatilis pal timumanawia itech ne taichtekit

source: See Additional Breaches
ppl: Shikita sejseuk mukaltapanalis

source: See All Breaches
ppl: Shikita Muchi Taichtekilis

source: See all data breaches in one place so you know which passwords to change. The breach dashboard is only available with an account.
ppl: Shikita muchi tamatil taichtekilis ka senkak pal tikmati katiawel ichtakatajkwilul pal tikpata. Ne taichtekilis tamatiltachialis semaya ijtuk iwan se ishtapual.

source: See if you’ve been part of an online data breach.
ppl: Shikita asu se mukaltapan tik mudajdatoj matapan

source: See if you were in this breach
ppl: Shikita asu tinenki tik ini kaltapanalis

source: Select your browser’s back button, reload the page, and try again.
ppl: Shikpachu ne botón ka ipan ipal ne tay iwan titajtachia, shikalaki uksenpa tik ne iswat, wan shikejeku uksenpa.

source: Send all breach alerts to { $primaryEmail }.
ppl: Shiktitani muchi ne kaltapanilis ka { $primaryEmail }.

source: Send Verification Link
ppl: Shiktitani ne ilpika kan mupepettuk

source: Sensitive Breaches
ppl: Kaltapanalis tesajsay

source: Sensitive Website Breach
ppl: Kaltapanalis ipal ne datuj tik se iswat ka matapan

source: Sent!
ppl: Mutitanijtuk!

source: Session timed out
ppl: Ne sesión puliwki

source: Short, single-word passwords are easy for hackers to guess. Use at least two words and a combination of letters, digits, and special characters.
ppl: Ne taketzalis ichtaka kutu u iwan maya se taketzalis, yaja te uij pal kimatit ne hackers.

source: Show All
ppl: Shikneshti muchi

source: Show all breaches for this email.
ppl: Shikneshti muchi ne kaltapanalis ipal ini correoj.

source: Showing:
ppl: Shikneshti:

source: Signed in as: { $userEmail }
ppl: Timukalaktij ken: { $userEmail }

source: Sign In
ppl: Shiktali mutukay

source: Sign Out
ppl: Shikishti mutukay

source: Sign Up
ppl: Shikchiwa mucuentaj

source: Sign up for Alerts
ppl: Shikchiwa se cuentaj pal metznawatiat

source: Sign up for breach monitoring
ppl: Shiktali mutukay pal metznawatia ipanpa ne kaltapanalis

source: Sorry, that breach is not in our database.
ppl: Uni mukaltapanalis tesu kanaj tik ne basej ipal dajdatoj tupal.

source: Spam List Breach
ppl: Kaltapanalis tik ne listaj ipal correoj kupajsul

source: Spam List Breaches
ppl: Listaj ipal kaltapanalis te tiknekit

source: Stay alert to more breaches
ppl: Shikchia asu nemi seuk taichtekilis

source: Stay alert to new breaches
ppl: Shikishpelwi ne yankwik kaltapanalis

source: Steps to take to protect your online identity
ppl: Ken tiweli tikpalewia muidentidad matapan

source: Stop monitoring this email.
ppl: Makaya shikpepeta ini email.

source: Stop reusing the same passwords
ppl: Makaya shikwi ne sesan taketzalis ichtaka

source: Stop using that exposed password entirely.
ppl: Makaya shikwi ne taketzalis ichtaka muneshtijkia.

source: Stop using the exposed password, and change it everywhere you’ve used it.
ppl: Makaya shikalakti ne sesan taketzalis-ichtaka wan shikpata nujme kan tikalaktijtuk.

source: Stronger Passwords = Better Protection
ppl: Taketzalis ichtaka = Chupiuk tajpialis

source: Take action to protect your accounts
ppl: Shiktajpia wan shikpalewi mucuejcuentaj

source: Take back control of your personal data.
ppl: Shimukwepa wan shitajshiti mutamatil.

source: Take further steps to protect your identity
ppl: Shikchiwa seuk pal tikpalewia muidentidad

source: Terms & Privacy
ppl: Tay nechtuktia wan Teichtakayu

source: There is a way to protect your privacy. Join { -brand-name }.
ppl: Weli tikmanawia muichtakayu. Shikishtuka { -brand-name }.

source: The strength of your passwords directly impacts your online security.
ppl: Asu mutaketzalis ichtaka tajpaltik, ijkiuni timupalewia tik ne matapan

source: This email address is not subscribed to { -product-name }.
ppl: Ini amatitantukayit tesu kipia itukay tik { -product-name }.

source: This email appeared in { $breachCount } known data breaches.
ppl: Ini correoj neski tik { $breachCount } mukajkaltapanalis matituk

source: This email appeared in { $breachCount } known data breaches, including { $breachName }.
ppl: Ini correoj neski tik { $breachCount } mukaltapanalis ipal majmattuk dajdatoj, nusan{ $breachName }.

source: This email appeared in the { $breachName } breach.
ppl: Ini correoj neski tik ne mukaltapanalis { $breachName }.

source: This email did not appear in the { $breachName } breach.
ppl: Ne correoj tesu neski tik ne mukaltapanalis { $breachName }.

source: This email has already been added to { -product-name }.
ppl: Ini amatitanti mutalijtuka tik { -product-name }.

source: This link expires in 24 hours
ppl: Ini ilpika puliwi tik 24 horaj.

source: This will remove your email from the { -product-name-nowrap } list and you will no longer receive alerts when new breaches are announced.
ppl: Yajini yawi kishtia ne itukay muamatitan tik ne listaj { -product-name-nowrap } wan tea yawi metznawatia keman kinekit kalakit ichtaka uksenpa.

source: To finish verifying this email for { -product-name }, you must be signed in under your primary account email.
ppl: Pal titamia tikita yek ini amatitanti ipal { -product-name }, nemi pal tikpia mutukay ken ne achtu cuentaj ipal ne amatitanti.

source: Too many connections to { -brand-HIBP }.
ppl: Miak nemit sajsalujtuk itech { -brand-HIBP }.

source: Turn off { -product-name } alerts. Your { -brand-fxa } will remain active, and you may receive other account-related communications.
ppl: Shiksewi ne tanawatilis ipal { -product-name }. Mu{ -brand-fxa } yawi naka mutimakatuk, wan tiu-tikpia seuk tanujnutzalis ipal cuentaj.

source: Understand how hackers work
ppl: Shimumachti ken ne hackers kaltapanat.

source: Unlike a website breach, there’s no password to change.
ppl: Ika tesu se kaltapanalis, te nemi pal mupata ne taketzalis ichtaka.

source: Unsubscribe
ppl: Shikishti mutukay

source: Unsubscribe from { -product-name-nowrap }
ppl: Shikishti mutukay tik { -product-name-nowrap }

source: Unsubscribing requires a token.
ppl: Pal tikishtia mutukay, kineki se token.

source: Unsubscribing requires a token and emailHash.
ppl: Pal tikishtia mutukay, kineki se token wan emailHash.

source: Unverified Breach
ppl: Kaltapanalis teuk mupepettuk

source: Unverified Breaches
ppl: Kaltapanalis teuk mupepettuk
